In [2]:
import numpy as np
import pandas as pd
from pandas import DataFrame, Series

In [3]:
data = {
    'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
    'year': [2000, 2001, 2002, 2001, 2002],
    'pop': [1.5, 1.7, 3.6, 2.4, 2.9]
}
frame = DataFrame(data)

In [4]:
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [5]:
DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [8]:
frame2 = DataFrame(data, columns=['year', 'state', 'pop', 'debt'], 
                   index=['one', 'two', 'three', 'four', 'five'])

In [9]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [12]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [13]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [14]:
frame2.ix['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [15]:
frame2['debt'] = 16.5

In [16]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [17]:
frame2['debt'] = np.arange(5.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  2.9     4

In [18]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
    'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [19]:
frame3 = DataFrame(pop)

In [20]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [21]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [22]:
frame3.values

array([[ nan,  1.5],
       [ 2.4,  1.7],
       [ 2.9,  3.6]])

# Index Objects

In [25]:
obj = Series(range(3), index=['a', 'b', 'c'])
obj

a    0
b    1
c    2
dtype: int64

In [26]:
index = obj.index
index

Index([u'a', u'b', u'c'], dtype='object')

In [27]:
index[1:]

Index([u'b', u'c'], dtype='object')

In [28]:
#index[1] = 'd'
# INDEX OBJECTS are immutable

In [31]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [29]:
'Ohio' in frame3.columns

True

In [30]:
2003 in frame3.index

False

# Reindexing

In [32]:
obj = Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [33]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [34]:
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value=0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [36]:
obj3 = Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [38]:
#ffill 
#bfill
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [39]:
frame = DataFrame(np.arange(9).reshape((3, 3)), index=['a', 'c', 'd'],
     columns=['Ohio', 'Texas', 'California'])

In [40]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [41]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])

In [42]:
frame2

   Ohio  Texas  California
a     0      1           2
b   NaN    NaN         NaN
c     3      4           5
d     6      7           8

In [43]:
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [48]:
frame.reindex(index=['a', 'b', 'c', 'd'], method='ffill',
     columns=states)

   Texas  Utah  California
a      1   NaN           2
b      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [49]:
frame.ix[['a', 'b', 'c', 'd'], states]

   Texas  Utah  California
a      1   NaN           2
b    NaN   NaN         NaN
c      4   NaN           5
d      7   NaN           8

# Dropping entries from an axis

In [3]:
obj = Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])

In [4]:
new_obj = obj.drop('c')
new_obj

a    0
b    1
d    3
e    4
dtype: float64

In [6]:
data = DataFrame(np.arange(16).reshape((4, 4)),
     index=['Ohio', 'Colorado', 'Utah', 'New York'], columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [8]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [13]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [14]:
data.drop(['two', 'four'], axis=1)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

# Indexing, Selection, and Filtering

In [15]:
obj['b']

1.0

In [16]:
obj[1]

1.0

In [19]:
obj[2:4]

c    2
d    3
dtype: float64

In [20]:
obj[['b', 'a', 'd']]

b    1
a    0
d    3
dtype: float64

In [21]:
obj[obj < 2]

a    0
b    1
dtype: float64

In [22]:
obj['b':'c'] #not the same as python slicing

b    1
c    2
dtype: float64

In [24]:
obj['b':'c'] = 5
obj

a    0
b    5
c    5
d    3
e    4
dtype: float64

In [25]:
data = DataFrame(np.arange(16).reshape((4, 4)),
 index=['Ohio', 'Colorado', 'Utah', 'New York'], columns=['one', 'two', 'three', 'four'])

In [26]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [27]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [28]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [29]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [30]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [31]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [33]:
data[data < 5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [34]:
data.ix['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int32

In [35]:
data.ix[['Colorado', 'Utah'], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [36]:
data.ix[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [37]:
data.ix[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [38]:
data.ix[data.three > 5, :3]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [39]:
df1 = DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
    index=['Ohio', 'Texas', 'Colorado'])

In [40]:
df2 = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [41]:
df1

          b  c  d
Ohio      0  1  2
Texas     3  4  5
Colorado  6  7  8

In [42]:
df2

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [43]:
df1+df2

           b   c   d   e
Colorado NaN NaN NaN NaN
Ohio       3 NaN   6 NaN
Oregon   NaN NaN NaN NaN
Texas      9 NaN  12 NaN
Utah     NaN NaN NaN NaN

# Mapping

In [44]:
frame = DataFrame(np.random.randn(4, 3), columns=list('bde'),
     index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [45]:
frame

               b         d         e
Utah    0.498709  1.516040  1.453716
Ohio   -0.793669  0.369071 -2.017666
Texas  -0.156443 -0.275006  1.026899
Oregon -0.196460 -0.851548  0.283493

In [46]:
np.abs(frame)

               b         d         e
Utah    0.498709  1.516040  1.453716
Ohio    0.793669  0.369071  2.017666
Texas   0.156443  0.275006  1.026899
Oregon  0.196460  0.851548  0.283493

In [47]:
f = lambda x: x.max() - x.min()

In [50]:
frame.apply(f)

b    1.292378
d    2.367588
e    3.471382
dtype: float64

In [51]:
frame.apply(f, axis=1)

Utah      1.017331
Ohio      2.386737
Texas     1.301906
Oregon    1.135041
dtype: float64

In [52]:
def f(x):
     return Series([x.min(), x.max()], index=['min', 'max'])

In [53]:
frame.apply(f)

            b         d         e
min -0.793669 -0.851548 -2.017666
max  0.498709  1.516040  1.453716

In [54]:
format = lambda x: '%.2f' % x

In [55]:
frame.applymap(format)

            b      d      e
Utah     0.50   1.52   1.45
Ohio    -0.79   0.37  -2.02
Texas   -0.16  -0.28   1.03
Oregon  -0.20  -0.85   0.28

# Sorting and Ranking

In [56]:
obj = Series(range(4), index=['d', 'a', 'b', 'c'])

In [57]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [58]:
frame = DataFrame(np.arange(8).reshape((2, 4)), index=['three', 'one'],
     columns=['d', 'a', 'b', 'c'])

In [59]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [60]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [63]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [64]:
obj = Series([4, 7, -3, 2])

In [66]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [67]:
obj = Series([4, np.nan, 7, np.nan, -3, 2])

In [68]:
obj.sort_values()

4    -3
5     2
0     4
2     7
1   NaN
3   NaN
dtype: float64

In [69]:
frame = DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})

In [70]:
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [72]:
frame.sort_values(by='b')

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [73]:
frame.sort_values(by=['a', 'b'])

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

In [75]:
obj = Series([7, -5, 7, 4, 2, 0, 4])

In [77]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [78]:
obj.rank(method='first')

0    6
1    1
2    7
3    4
4    3
5    2
6    5
dtype: float64

In [76]:
obj.rank(ascending=False, method='max')

0    2
1    7
2    2
3    4
4    5
5    6
6    4
dtype: float64

# Axis Indexes with Duplicate Values

In [79]:
obj = Series(range(5), index=['a', 'a', 'b', 'b', 'c'])

In [80]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [81]:
obj.index.is_unique

False

In [82]:
obj['a']

a    0
a    1
dtype: int64

In [83]:
df = DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])

In [84]:
df

          0         1         2
a -0.888830 -0.866235  1.402596
a -1.819343  1.776544 -0.335940
b -0.131374  0.643352  1.034033
b  0.597628 -0.786969  1.010045

In [85]:
df.ix['b']

          0         1         2
b -0.131374  0.643352  1.034033
b  0.597628 -0.786969  1.010045

# Summarizing and Computing Descriptive Statistics

In [86]:
df = DataFrame([[1.4, np.nan], [7.1, -4.5],
    [np.nan, np.nan], [0.75, -1.3]],
    index=['a', 'b', 'c', 'd'],
    columns=['one', 'two'])

In [87]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [88]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [89]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [90]:
df.mean(axis=1, skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [91]:
df.idxmax()

one    b
two    d
dtype: object

In [92]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [93]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

# Unique Values, Value Counts, and Membership

In [101]:
obj = Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [103]:
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [104]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [108]:
#pd.value_counts(obj.values, sort=False)

In [109]:
mask = obj.isin(['b', 'c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [110]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [111]:
data = DataFrame({'Qu1': [1, 3, 4, 3, 4], 'Qu2': [2, 3, 1, 2, 3], 'Qu3': [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [113]:
result = data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1    1    1    1
2    0    2    1
3    2    2    0
4    2    0    2
5    0    0    1

# Filtering Out Missing Data

In [114]:
from numpy import nan as NA

In [116]:
data = Series([1, NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [117]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [118]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [122]:
data = DataFrame([[1., 6.5, 3.], [1., NA, NA], [NA, NA, NA], [NA, 6.5, 3.]])
data

    0    1   2
0   1  6.5   3
1   1  NaN NaN
2 NaN  NaN NaN
3 NaN  6.5   3

In [121]:
cleaned = data.dropna()
cleaned

   0    1  2
0  1  6.5  3

In [123]:
data.dropna(how='all')

    0    1   2
0   1  6.5   3
1   1  NaN NaN
3 NaN  6.5   3

In [125]:
data[4] = NA
data

    0    1   2   4
0   1  6.5   3 NaN
1   1  NaN NaN NaN
2 NaN  NaN NaN NaN
3 NaN  6.5   3 NaN

In [126]:
data.dropna(axis=1, how='all')

    0    1   2
0   1  6.5   3
1   1  NaN NaN
2 NaN  NaN NaN
3 NaN  6.5   3

# Filling in Missing Data

In [127]:
df.fillna(0)

    one  two
a  1.40  0.0
b  7.10 -4.5
c  0.00  0.0
d  0.75 -1.3

# Hierarchical Indexing

In [128]:
data = Series(np.random.randn(10),
 index=[['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'],
 [1, 2, 3, 1, 2, 3, 1, 2, 2, 3]])

In [129]:
data

a  1   -1.734876
   2    0.347252
   3   -2.439165
b  1   -2.579400
   2    0.522098
   3    0.008608
c  1   -1.051897
   2   -0.096278
d  2    2.889254
   3   -0.515578
dtype: float64

In [130]:
data.index

MultiIndex(levels=[[u'a', u'b', u'c', u'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [132]:
data['b']

1   -2.579400
2    0.522098
3    0.008608
dtype: float64

In [133]:
data['b':'c']

b  1   -2.579400
   2    0.522098
   3    0.008608
c  1   -1.051897
   2   -0.096278
dtype: float64

In [134]:
data.ix[['b', 'd']]

b  1   -2.579400
   2    0.522098
   3    0.008608
d  2    2.889254
   3   -0.515578
dtype: float64

In [135]:
data[:, 2]

a    0.347252
b    0.522098
c   -0.096278
d    2.889254
dtype: float64

In [136]:
data.unstack()

          1         2         3
a -1.734876  0.347252 -2.439165
b -2.579400  0.522098  0.008608
c -1.051897 -0.096278       NaN
d       NaN  2.889254 -0.515578

In [137]:
data.unstack().stack()

a  1   -1.734876
   2    0.347252
   3   -2.439165
b  1   -2.579400
   2    0.522098
   3    0.008608
c  1   -1.051897
   2   -0.096278
d  2    2.889254
   3   -0.515578
dtype: float64

In [138]:
frame = DataFrame(np.arange(12).reshape((4, 3)),
 index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
 columns=[['Ohio', 'Ohio', 'Colorado'],
 ['Green', 'Red', 'Green']])

In [139]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [140]:
frame.index.names = ['key1', 'key2']

In [141]:
frame.columns.names = ['state', 'color']

In [142]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11